    "use strict";

    // // класичний синтаксис створення регулярного виразу
    // new RegExp('pattern', 'flags');
    // // короткий запис
    // /pattern/flags
    // метод пошуку
    // const ans = prompt('Напишіть ваше імя');
    const reg = /n/igm;
    // флаги gmi / mgi порядок не має значення
    // i - шукати не залежно від регістра
    // g - шукати декілька співпадінь - не підходить лля search... працює з match
    // m - включає багатострічковий режим
    // класи регулярних виразів
    // \d - шукаємо всі цифри
    // \w - шукаємо всі слова/букви
    // \s - шукаємо всі пробіли
    // зворотні класи
    // \D - шукаємо не цифри
    // \W - шукаємо не слова/букви
    // \S - шукаємо не пробіли

    console.log(reg.test(ans));  // перевіряємо чи знаходить регулярний вираз в стрічці дані свого запиту
    // console.log(ans.search(reg));
    // console.log(ans.match(reg));  // видає дані масивом

    const pass = prompt('Password');
    // трансформуємо пароль
    console.log(pass.replace(/./g, '*')); // заміняємо всі символи /./ на зірочки
    console.log(pass.replace(/\./g, '*')); // заміняємо всі крапки /\./ на зірочки - \ екранує і говорить, що використовується не спеціальний символ а саме крапка
    // замінимо - на :
    console.log('12-56-89'.replace(/-/g, ':')); // 12:56:89
    console.log('12-56-89'.replace(/-/g, '')); // 125689

    // комбінований пошук
    const str = 'My name is R2d2';
    console.log(str.match(/\w\d\w\d/i)); // шукаємо R2D2 без врахування регістра \w\d\w\d/i 